/**
 * 是否url
 * @param {url}} str_url
 * @return Boolean
 */
Mil.IsURL = function (str_url) {
  var strRegex =
    "^((https|http|ftp|rtsp|mms)?://)" +
    "?(([0-9a-z_!~*'().&=+$%-]+: )?[0-9a-z_!~*'().&=+$%-]+@)?" + //ftp的user@
    "(([0-9]{1,3}.){3}[0-9]{1,3}" + // IP形式的URL- 199.194.52.184
    "|" + // 允许IP和DOMAIN（域名）
    "([0-9a-z_!~*'()-]+.)*" + // 域名- www.
    "([0-9a-z][0-9a-z-]{0,61})?[0-9a-z]." + // 二级域名
    "[a-z]{2,6})" + // first level domain- .com or .museum
    "(:[0-9]{1,4})?" + // 端口- :80
    "((/?)|" + // a slash isn't required if there is no file name
    "(/[0-9a-z_!~*'().;?:@&=+$,%#-]+)+/?)$";
  var re = new RegExp(strRegex);
  //re.test()
  if (re.test(str_url)) {
    return true;
  } else {
    return false;
  }
}

// phone number
Mil.phoneReg = /^(13[0-9]{1}|14[5|7|9]{1}|15[0-3|5-9]{1}|166|17[0-3|5-8]{1}|18[0-9]{1}|19[8-9]{1}){1}\d{8}$/;

// 用户名 4到16位（字母、数字、下划线、减号）
Mil.usernameReg = /^[a-zA-Z0-9_-]{4,16}$/;

// 密码强度正则，最少6位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符
Mil.passwordReg = /^.*(?=.{6,})(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$/;

// 正整数正则
Mil.integerReg1 = /^\d+$/;
//负整数正则
Mil.integerReg2 = /^-\d+$/;
//整数正则
Mil.integerReg3 = /^-?\d+$/;

//正数正则
Mil.numberReg1 = /^\d*\.?\d+$/;
//负数正则
Mil.numberReg2 = /^-\d*\.?\d+$/;
//数字正则
Mil.numberReg3 = /^-?\d*\.?\d+$/;

//Email正则
Mil.emailReg = /^([A-Za-z0-9_\-\.])+\@([A-Za-z0-9_\-\.])+\.([A-Za-z]{2,4})$/;

// 身份证号（18位）正则
Mil.idCardReg = /^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/;

//URL正则
Mil.urlReg= /^((https?|ftp|file):\/\/)?([\da-z\.-]+)\.([a-z\.]{2,6})([\/\w \.-]*)*\/?$/;

//ipv4地址正则
Mil.ipv4Reg = /^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/;

//RGB Hex颜色正则
Mil.rgbHexReg = /^#?([a-fA-F0-9]{6}|[a-fA-F0-9]{3})$/;

// 日期正则，简单判定,未做月份及日期的判定
Mil.dateReg1 = /^\d{4}(\-)\d{1,2}\1\d{1,2}$/;
//日期正则，复杂判定
Mil.dateReg2 = /^(?:(?!0000)[0-9]{4}-(?:(?:0[1-9]|1[0-2])-(?:0[1-9]|1[0-9]|2[0-8])|(?:0[13-9]|1[0-2])-(?:29|30)|(?:0[13578]|1[02])-31)|(?:[0-9]{2}(?:0[48]|[2468][048]|[13579][26])|(?:0[48]|[2468][048]|[13579][26])00)-02-29)$/;

//QQ号正则，5至11位
Mil.qqReg = /^[1-9][0-9]{4,10}$/;
